README.org
#+SETUPFILE: http://portalsf.surge.sh/static/org-themes/retro_dark/retro_dark.theme
#+TITLE:DotFiles README
#+AUTHOR:AndrewC
#+DESCRIPTION:This repo contains my dotfiles. This readme includes scripts/urls/commands to run on a new system.
#+DATE:<2022-07-12 Tue>

* New Linux System w/ Aptitude PKG Manager
** Change Console Resolution on Headless Ubuntu System [[https://askubuntu.com/questions/18444/how-do-i-increase-console-mode-resolution][(Q&A)]]
*** Open /etc/default/grub and change/add the following
GRUB_GFXMODE=1920x1080x32
GRUB_GFXPAYLOAD=1920x1080x32

*** Open /etc/grub.d/00_header and Change the following
if [ "x${GRUB_GFXMODE}" = "x" ] ; then GRUB_GFXMODE=1920x1080x32 ; fi
if [ "x${GRUB_GFXPAYLOAD}" = "x" ] ; then GRUB_GFXPAYLOAD=1920x1080x32 ; fi

*** Add the following
set gfxmode=${GRUB_GFXMODE}
set gfxpayload=${GRUB_GFXPAYLOAD}

*** sudo update-grub2
    
** Installing Vundle for vim
*** Vundle
git clone https://github.com/VundleVim/Vundle.vim.git ~/.vim/bundle/Vundle.vim

*** lsd 
git clone https://github.com/Peltoche/lsd
cargo install lsd
export PATH=/home/USERNAME/.cargo/bin:$PATH

*** Only if using clean vimrc
set nocompatible              " be iMproved, required
filetype off                  " required

" set the runtime path to include Vundle and initialize
set rtp+=~/.vim/bundle/Vundle.vim
call vundle#begin()

** apt packages
sudo apt install npm python3.10 base-devel linux-headers-$(uname -r) emacs vim yarn thefuck tmux btop bat 


