README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-15 Thu 01:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DotFiles README</title>
<meta name="author" content="AndrewC" />
<meta name="description" content="This repo contains my dotfiles. This readme includes scripts/urls/commands to run on a new system." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">DotFiles README</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org430a741">1. New Linux System w/ Aptitude PKG Manager</a>
<ul>
<li><a href="#org00afcc3">1.1. Change Console Resolution on Headless Ubuntu System (Q&amp;A)</a>
<ul>
<li><a href="#orgaad2adf">1.1.1. Open /etc/default/grub and change/add the following</a></li>
<li><a href="#org6877edb">1.1.2. Open /etc/grub.d/00<sub>header</sub> and Change the following</a></li>
<li><a href="#org12bc968">1.1.3. Add the following</a></li>
<li><a href="#org29fb04b">1.1.4. sudo update-grub2</a></li>
</ul>
</li>
<li><a href="#org2a36da9">1.2. Installing Vundle for vim</a>
<ul>
<li><a href="#org3535239">1.2.1. Vundle</a></li>
<li><a href="#org63d7efb">1.2.2. lsd</a></li>
<li><a href="#org57fb275">1.2.3. Only if using clean vimrc</a></li>
</ul>
</li>
<li><a href="#orge3d2f6a">1.3. apt packages</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org430a741" class="outline-2">
<h2 id="org430a741"><span class="section-number-2">1.</span> New Linux System w/ Aptitude PKG Manager</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org00afcc3" class="outline-3">
<h3 id="org00afcc3"><span class="section-number-3">1.1.</span> Change Console Resolution on Headless Ubuntu System <a href="https://askubuntu.com/questions/18444/how-do-i-increase-console-mode-resolution">(Q&amp;A)</a></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgaad2adf" class="outline-4">
<h4 id="orgaad2adf"><span class="section-number-4">1.1.1.</span> Open /etc/default/grub and change/add the following</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
GRUB<sub>GFXMODE</sub>=1920x1080x32
GRUB<sub>GFXPAYLOAD</sub>=1920x1080x32
</p>
</div>
</div>

<div id="outline-container-org6877edb" class="outline-4">
<h4 id="org6877edb"><span class="section-number-4">1.1.2.</span> Open /etc/grub.d/00<sub>header</sub> and Change the following</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
if [ "x\({GRUB_GFXMODE}" = "x" ] ; then GRUB_GFXMODE=1920x1080x32 ; fi
if [ "x\){GRUB<sub>GFXPAYLOAD</sub>}" = "x" ] ; then GRUB<sub>GFXPAYLOAD</sub>=1920x1080x32 ; fi
</p>
</div>
</div>

<div id="outline-container-org12bc968" class="outline-4">
<h4 id="org12bc968"><span class="section-number-4">1.1.3.</span> Add the following</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
set gfxmode=\({GRUB_GFXMODE}
set gfxpayload=\){GRUB<sub>GFXPAYLOAD</sub>}
</p>
</div>
</div>

<div id="outline-container-org29fb04b" class="outline-4">
<h4 id="org29fb04b"><span class="section-number-4">1.1.4.</span> sudo update-grub2</h4>
</div>
</div>

<div id="outline-container-org2a36da9" class="outline-3">
<h3 id="org2a36da9"><span class="section-number-3">1.2.</span> Installing Vundle for vim</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org3535239" class="outline-4">
<h4 id="org3535239"><span class="section-number-4">1.2.1.</span> Vundle</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
git clone <a href="https://github.com/VundleVim/Vundle.vim.git">https://github.com/VundleVim/Vundle.vim.git</a> ~/.vim/bundle/Vundle.vim
</p>
</div>
</div>

<div id="outline-container-org63d7efb" class="outline-4">
<h4 id="org63d7efb"><span class="section-number-4">1.2.2.</span> lsd</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
git clone <a href="https://github.com/Peltoche/lsd">https://github.com/Peltoche/lsd</a>
cargo install lsd
export PATH=/home/USERNAME/.cargo/bin:$PATH
</p>
</div>
</div>

<div id="outline-container-org57fb275" class="outline-4">
<h4 id="org57fb275"><span class="section-number-4">1.2.3.</span> Only if using clean vimrc</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
set nocompatible              " be iMproved, required
filetype off                  " required
</p>

<p>
" set the runtime path to include Vundle and initialize
set rtp+=~/.vim/bundle/Vundle.vim
call vundle#begin()
</p>
</div>
</div>
</div>

<div id="outline-container-orge3d2f6a" class="outline-3">
<h3 id="orge3d2f6a"><span class="section-number-3">1.3.</span> apt packages</h3>
<div class="outline-text-3" id="text-1-3">
<p>
sudo apt install npm python3.10 base-devel linux-headers-$(uname -r) emacs vim yarn thefuck tmux btop bat 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-07-12 Tue 00:00</p>
<p class="author">Author: AndrewC</p>
<p class="date">Created: 2022-09-15 Thu 01:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
